/*----------------------------------------------------------------------------------------

	SearchDlg.h

----------------------------------------------------------------------------------------*/
/*----------------------------------------------------------------------------------------
	定義
----------------------------------------------------------------------------------------*/
#define SEARCHHISTORY_FILE					(LPCTSTR)"\\SearchHistory.dat"
#define MAX_HISTORY							20
#define MAX_SEARCH_STRING					260

typedef struct _tagSEARCHDATA
{
	char szSearchString[MAX_SEARCH_STRING];
	DWORD dwCmdFlags;
	DWORD dwCmdExFlags;
	DWORD dwSrcFlags;
} SEARCHDATA, *LPSEARCHDATA;

/*----------------------------------------------------------------------------------------
	関数プロトタイプ
----------------------------------------------------------------------------------------*/
int ShowSearchDlg(HWND hParent);
